W6/w6d3/first_project/app/controllers/users_controller.rb

    def show #find and show the user by their id
        user = User.find_by(id: params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]