W6/w6d3/art_share_api/app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show #find and show the user by their id
        user = User.find_by(id: params[:id])

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "users" SET "email" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["email", "App.Academy@yahoo.com"], ["updated_at", "2020-12-31 00:35:34.534598"], ["id", 3]]
---
    def update
        user = User.find_by(id: params[:id])
        if user.update(user_params)