w7d2/music_app/app/controllers/bands_controller.rb

SELECT "bands".* FROM "bands"
---
    def index
        @band = Band.all